[
  {
    "title": "Hubble Captures Starry Spectacle",
    "url": "https://science.nasa.gov/missions/hubble/hubble-captures-starry-spectacle/",
    "published": "Fri, 06 Jun 2025 11:00:00 +0000",
    "content": "This NASA/ESA Hubble Space Telescope image features the barred spiral galaxy NGC 685. ESA/Hubble & NASA, J. Lee, F. Belfiore\n\nA galaxy ablaze with young stars is the subject of this NASA/ESA Hubble Space Telescope image. Named NGC 685, this galaxy is situated about 64 million light-years away in the constellation Eridanus (the River). NGC 685 is a barred spiral because its feathery spiral arms sprout from the ends of a bar of stars at the galaxy’s center. The Milky Way is also a barred spiral, but our galaxy is a little less than twice the size of NGC 685.\n\nAstronomers used Hubble to study NGC 685 for two observing programs, both focused on star formation. It’s no surprise that NGC 685 was part of these programs: numerous patches of young, blue stars highlight the galaxy’s spiral arms. Also visible are pink gas clouds, called H II (pronounced ‘H-two’) regions, that glow for a short time when particularly hot and massive stars are born. An especially eye-catching H II region peeks out at the bottom edge of the image. Despite the dozens of star-forming regions evident in this image, NGC 685 converts an amount of gas equivalent to less than half the mass of the Sun into stars each year.\n\nThe Hubble data collected for the two observing programs will allow astronomers to catalogue 50,000 H II regions and 100,000 star clusters in nearby galaxies. By combining Hubble’s sensitive visible and ultraviolet observations with infrared data from the NASA/ESA/CSA James Webb Space Telescope and radio data from the Atacama Large Millimeter/submillimeter Array, researchers can peer into the depths of dusty stellar nurseries and illuminate the stars forming there.\n\nText Credit: ESA/Hubble\n\nMedia Contact:\n\nClaire Andreoli (claire.andreoli@nasa.gov)\n\nNASA's Goddard Space Flight Center, Greenbelt, MD",
    "summary": "NASA/ESA Hubble Space Telescope image features the barred spiral galaxy NGC 685 . The galaxy is situated 64 million light-years away in the constellation Eridanus (the River) The Milky Way is also barred because its feathery spiral arms sprout from the ends of a bar of stars at the galaxy’s center . Hubble's sensitive visible and ultraviolet observations can be combined with infrared data from the NASA/ESA/CSA James Webb Space Telescope . researchers can peer into the depths of dusty stellar nurseries and illuminate the stars forming there .",
    "authors": [],
    "source": "NASA",
    "fetched_at": "2025-06-06T17:54:21.724139",
    "summarized_at": "2025-06-06T18:04:07.410003"
  },
  {
    "title": "NASA Awards Third Crowdsourcing Contract Iteration",
    "url": "https://www.nasa.gov/news-release/nasa-awards-third-crowdsourcing-contract-iteration/",
    "published": "Thu, 05 Jun 2025 20:34:27 +0000",
    "content": "Credit: NASA\n\nNASA continues to collaborate with global communities to solve complex challenges through crowdsourcing with a series of 25 new NASA Open Innovation Service (NOIS) contracts managed by the agency’s Johnson Space Center in Houston.\n\nThe contract aims to empower NASA’s workforce by actively engaging the public to find creative solutions to difficult space exploration challenges through rapid experimentation with new methodologies, new technologies, and unique perspectives, ensuring NASA remains at the forefront of innovation while accomplishing its missions.\n\nThis is the third NOIS contract, managed by NASA’s Center of Excellence for Collaborative Innovation (CoECI), and used by NASA and other government agencies. The NOIS3 contract will provide solutions through multiple crowdsourcing tools and methodologies, which include public prize competitions, freelance tasking, technology searches, and other crowd-based methods.\n\nThe total value of the NOIS3 contract is $475 million over 10 years. There is a guaranteed $500 minimum obligation for each contract award. The base contract spans June 5, 2025, through May 31, 2027, and there are two options, the first for three years, and the second for five years. If all options are exercised, work could continue through May 31, 2035.\n\nThe awardees are:\n\nBlue Clarity, Vienna, Virginia\n\nCapital Consulting Corp., Fairfax, Virginia\n\nChallenge Works, London, United Kingdom\n\nCrowdPlat Inc., Pleasanton, California\n\nDesign Interactive Inc., Orlando, Florida\n\nDrivenData Inc., Denver\n\nEnsemble Government Services, Hyattsville, Maryland\n\nHyperion Technologies, Arlington, Virginia\n\nFloor23 Digital, Jackson, Wisconsin\n\nFreelancer International, Sydney, Australia\n\nHeroX, Wilmington, Delaware\n\nHYVE Innovate, Munchen, Germany\n\nInnoget, Rockville, Maryland\n\nInstitute of Competition Sciences, San Francisco\n\nLoyal Source Government Services, Orlando, Florida\n\nLuminary Labs, New York City\n\nNational Institute of Aerospace Associates, Hampton, Virginia\n\nRandstad Federal, Duluth, Georgia\n\nRios Partners, Arlington, Virginia\n\nSecondMuse, Bernalillo, New Mexico\n\nTechConnect, Summerville, South Carolina\n\nToffler Associates, Arlington, Virginia\n\nTongal Inc., Los Angeles\n\nTopcocder, Indianapolis\n\nyet2.com Inc., Waltham, Massachusetts\n\nNASA’s CoECI provides guidance on open innovation initiatives, helping define challenges and requirements and formulating and evaluating potential solutions. The center’s end-to-end service allows NASA and other federal agencies to rapidly experiment with new methods and solve critical problems through innovation and collaboration.\n\nLearn more about the NASA Center of Excellence at:\n\nhttps://www.nasa.gov/coeci\n\n-end-\n\nTiernan Doyle\n\nHeadquarters, Washington\n\n202-358-1600\n\ntiernan.doyle@nasa.gov\n\nKelly Humphries\n\nJohnson Space Center, Houston\n\n281-483-5111\n\nkelly.o.humphries@nasa.gov",
    "summary": "The NOIS3 contract aims to empower NASA’s workforce by engaging the public to find creative solutions to difficult space exploration challenges through rapid experimentation with new methodologies, new technologies, and unique perspectives . This is the third NOIS contract, managed by NASA's Center of Excellence for Collaborative Innovation (CoECI), and used by NASA and other government agencies . There is a guaranteed $500 minimum obligation for each contract award. The base contract spans June 5, 2025, through May 31, 2027 . Denver Ensemble Government Services, Hyattsville, Maryland Hyperion Technologies, Arlington, Virginia Floor23 Digital, Jackson, Wisconsin Freelancer International, Sydney, Australia HeroX, Wilmington, Delaware HYVE Innovate, Munchen, Germany Innoget, Rockville, Maryland Institute of Competition Sciences . The center’s end-to-end service allows NASA and other federal agencies to rapidly experiment with new methods and solve critical problems through innovation and collaboration .",
    "authors": [
      "Tiernan P. Doyle"
    ],
    "source": "NASA",
    "fetched_at": "2025-06-06T17:54:21.724145",
    "summarized_at": "2025-06-06T18:04:14.400405"
  },
  {
    "title": "The Sky This Week from June 6 to 13: Jupiter and Mercury meet",
    "url": "https://www.astronomy.com/the-sky-this-week/the-sky-this-week-from-june-6-to-13-2025/",
    "published": "Fri, 06 Jun 2025 05:00:00 +0000",
    "content": "Jupiter meets Mercury in a conjunction visible for a short time after sunset in early June. Credit: Astronomy: Roen Kelly\n\nSky This Week is brought to you in part by Celestron.\n\nFriday, June 6\n\nThe Moon passes 0.5° south of the magnitude 1.0 star Spica at 11 A.M. EDT. The pair hangs in the evening sky, located in the south two hours after sunset. They are now some 6.3° apart, with the waxing Moon to Spica’s lower left.\n\nNow draw a line between the two and continue following it to the lower left, toward the horizon. The next bright star you will land on, some 18° high, is bright red Antares, the heart of Scorpius the Scorpion. Shining at magnitude 1.1, it should look roughly as bright as Spica, albeit much redder. That’s because Spica is a younger, hot blue-white star; Antares is an older, cool red giant start in the latter stages of its life.\n\nIf you’ve got binoculars or a telescope, center the view on Antares and then move your gaze just 1.3° west — you may not need to physically slide your optics at all, as our target might already sit within your field of view: the globular cluster M4. Shining at magnitude 5.6, this aged group of stars is one of the closest globulars to Earth, roughly 7,200 light-years away. Its stars span some 36’ on the sky, a little larger than the area covered by the Full Moon. It makes a lovely sight, particularly given its proximity to Antares.\n\nThe Moon will pass close to Antares later this week, so we’ll make sure to stop back in this region in a few days to take in that sight.\n\nSunrise: 5:32 A.M.\n\nSunset: 8:26 P.M.\n\nMoonrise: 4:22 P.M.\n\nMoonset: 2:38 A.M.\n\nMoon Phase: Waxing gibbous (82%)\n\n*Times for sunrise, sunset, moonrise, and moonset are given in local time from 40° N 90° W. The Moon’s illumination is given at 12 P.M. local time from the same location.\n\nSaturday, June 7\n\nThe Moon reaches apogee at 6:44 A.M. EDT. This is when the Moon is at its farthest point from Earth in its orbit; this morning, our satellite will be 251,999 miles (405,553 km) away.\n\nIf you’re in the market for some deep-sky observing, early morning is your time. There’s a short dark window of about an hour after the Moon sets and before twilight begins to brighten the sky.\n\nThis morning, we’re enjoying one of the most famous planetary nebulae in the sky: M27, the Dumbbell Nebula. Shining at magnitude 7.4 and stretching some 8’ by 6’, this was the first planetary nebula ever discovered. Its common name is derived from its distinctly elongated, bi-lobed shape, which to visual observers appears narrower in the center and rounder at each end (like a dumbbell or bow tie). Deeper astrophotos, however, show that the nebula has a spherical shell in addition to its brighter, bow tie-shaped component.\n\nYou can spot M27 with either binoculars or a telescope. Start by looking south around 3:30 A.M. local daylight time, where Aquila the Eagle flies high in the sky, anchored by its brightest star, Altair. From Altair, slide your gaze nearly 11° north to land on magnitude 3.5 Gamma (γ) Sagittae. From this star, it’s a short 3.2° jaunt further northward again to find the Dumbbell. Astronomy contributing editor Phil Harrington recommends that if you’re using a telescope, employ a low-power eyepiece to first find the Dumbbell, then drop in a higher-powered eyepiece to explore its detail. Additionally, observers with larger scopes (10 inches or more) can try for the nebula’s central white dwarf, which shines at 13th magnitude.\n\nSunrise: 5:32 A.M.\n\nSunset: 8:27 P.M.\n\nMoonrise: 5:24 P.M.\n\nMoonset: 3:00 A.M.\n\nMoon Phase: Waxing gibbous (88%)\n\nSunday, June 8\n\nJupiter is getting lower and lower in the evening sky; soon it will be lost from view as it heads for conjunction with the Sun.\n\nBut first, the solar system’s largest planet is teaming up with our smallest world: Today, these two worlds are in conjunction as Mercury passes 2° north of Jupiter at 4 P.M. EDT.\n\nYou can catch them together in the evening twilight, sinking in the west after sunset. But be quick: They are just a few degrees above the horizon half an hour after sunset. If you can get to a location with a clear western horizon, you’ll have the best chance of the longest view before the gas giant slips out of sight.\n\nMercury, shining at magnitude –1.3, stands just to Jupiter’s upper right. The gas giant shines at magnitude –1.9, only slightly brighter. Both will fit well inside the field of view of binoculars and may also stand together in a wide-field telescope eyepiece or your finder scope. Take care not to pull out any optics for use until the Sun has fully set from your location, which may differ from the time given below.\n\nTake a look at each planet in turn. Mercury, physically much smaller but closer to Earth, shows off a disk that’s 5” wide and 89 percent lit. Jupiter is fully lit and appears 32” wide — a testament to its truly massive size, despite its greater distance. Mercury is currently some 116 billion miles (187 billion km) from Earth, while Jupiter is nearly 570 billion miles (917 billion km) distant.\n\nAlthough Jupiter is flanked by its four Galilean moons, they will be difficult to make out in the brightening sky. The planet’s Great Red Spot is also transiting this morning and may be visible for those with particularly steady seeing.\n\nSunrise: 5:31 A.M.\n\nSunset: 8:27 P.M.\n\nMoonrise: 6:26 P.M.\n\nMoonset: 3:25 A.M.\n\nMoon Phase: Waxing gibbous (94%)\n\nGlobular cluster M92 lies 26,000 light-years away and is visible as a fuzzy haze through binoculars. Credit: Neil Fleming\n\nMonday, June 9\n\nThe constellation Hercules is high in the east after dark this evening. Rich with deep-sky objects, we’re passing by the Strongman’s most famous (M13) for its second-brightest globular cluster: M92.\n\nBut don’t feel like you’re settling for second best: This cluster is only a little fainter and smaller than M13, so it’s a stunning sight in its own right.\n\nShining at magnitude 6.4, you’ll find M92 about 6.3° north of magnitude 3.2 Pi (π) Herculis, one of the four stars in the Keystone asterism. Spanning about 14’, M92 is a dense ball of aging stars that lies nearly 27,000 light-years away and is an estimated 14 billion years old. Although visible to the naked eye under good conditions, the bright moonlight pervading the sky tonight will likely make M92 a binocular or telescope object only. However, one benefit of this bright cluster is that no matter your optics, it should look stunning. Note particularly its dense, compact core, and don’t be afraid to bump up the power in your telescope when viewing it.\n\nSunrise: 5:31 A.M.\n\nSunset: 8:28 P.M.\n\nMoonrise: 7:30 P.M.\n\nMoonset: 3:54 A.M.\n\nMoon Phase: Waxing gibbous (97%)\n\nTuesday, June 10\n\nThe Moon now passes 0.3° south of Antares at 7 A.M. EDT. You can catch them early this morning, when they are highest in the south just after midnight on the 9th. The Moon’s bright light dominates the southern sky as our satellite quickly waxes toward the Full phase, which it will reach in just over 24 hours.\n\nEarly this morning you’ll see the Moon just to the lower right of Antares. The Scorpion’s alpha star shines at magnitude 1.1 and should remain visible even in the moonlight. It shows off a notable red hue, thanks to its relatively cool surface temperature of 6,000 F (3,300 C).\n\nSpica, the 1st-magnitude star in Virgo that the Moon passed by late last week, is now far to the pair’s upper right.\n\nLook carefully for the long, curving tail of Scorpius to the pair’s lower left, closer to the horizon. Shaula (Lambda [λ] Scorpii), which shines at magnitude 1.6, is the brighter of two stars in Scorpius’ stinger — you may be able to spot this star relatively well.\n\nSunrise: 5:31 A.M.\n\nSunset: 8:28 P.M.\n\nMoonrise: 8:30 P.M.\n\nMoonset: 4:31 A.M.\n\nMoon Phase: Waxing gibbous (99%)\n\nThe Full Strawberry Moon sets above foggy San Francisco in this shot from a 2024 timelapse video. Credit: Jay Huang (Flickr, CC BY-NC 2.0)\n\nWednesday, June 11\n\nFull Moon occurs this morning at 3:44 A.M. EDT. Early risers can catch the Moon setting in the southwest shortly before sunrise, while anyone out in the evening will see the Full Moon rising again in the southeast not long after the Sun has set. That’s because the Full Moon is always located opposite the Sun in our sky, rising around sunset and setting around sunrise.\n\nJune’s Full Moon is also called the Strawberry Moon, but don’t let the name fool you — it won’t be turning pink in the sky! The moniker comes from several Native American tribes, who named it for the fact that June in North America is the time when early strawberries are often ripe for picking.\n\nYou may also notice that the Full Moon arcs low through the southern sky tonight, rather than soaring high overhead as it sometimes seems to do. That’s because we’re getting close to the summer solstice in the Northern Hemisphere, when the Sun is highest in the sky. The Full Moon around this time is generally the lowest we see all year. At its highest point overnight tonight, when the Moon hangs just off the spout of Sagittarius’ Teapot in the south, it will only reach an altitude of roughly 20° above the horizon from the mid-U.S. Note that it may climb higher or lower depending on your location (more specifically, your latitude).\n\nSunrise: 5:31 A.M.\n\nSunset: 8:29 P.M.\n\nMoonrise: 9:27 P.M.\n\nMoonset: 5:16 A.M.\n\nMoon Phase: Full\n\nThursday, June 12\n\nSaturn’s two-faced moon Iapetus reaches its greatest western elongation today. At western elongation, the moon’s lighter hemisphere is turned toward Earth, making it brightest and easiest to view through a telescope.\n\nFirst, locate Saturn above the eastern horizon around 4 A.M. local daylight time, roughly 90 minutes before sunrise. At this time, the planet should be high enough (25°) that it’s not too affected by the turbulent air close to the horizon, but the sky should also be dark enough to allow you to pull Iapetus out from the background. Saturn itself shines at magnitude 1.0, hanging beneath the Circlet of Pisces and to the far upper right of blazing Venus, which lies closer to the ground and shines a brighter magnitude –4.3.\n\nOnce your telescope is locked on Saturn, you’ll likely notice its biggest and brightest moon, 9th-magnitude Titan, sitting about 3’ east of the ringed planet. Iapetus, one magnitude fainter, lies on the other side of the world, some 8.5’ to Saturn’s west. Several 10th-magnitude moons cluster closer to the rings as well — Dione and Rhea lie just west of the planet, less than about 1’ away. Tethys may be visible to the west of the planet for some East Coast observers as well, but it’s moving into Saturn’s shadow and then behind the planet in an occultation for most U.S. observers.\n\nSunrise: 5:31 A.M.\n\nSunset: 8:29 P.M.\n\nMoonrise: 10:17 P.M.\n\nMoonset: 6:09 A.M.\n\nMoon Phase: Waning gibbous (98%)\n\nFriday, June 13\n\nMercury has brightened a bit and now shines at magnitude –0.8 in the evening sky, lingering above the horizon some 80 minutes after the Sun disappears. Tonight, the solar system’s smallest planet stands just 20′ from the 3rd-magnitude star Mebsuta (Epsilon [ε] Geminorum), near the middle of the constellation Gemini.\n\nYou can catch the pairing with binoculars or a small scope shortly after sunset. Try looking west about 45 minutes after the Sun disappears — the two points of light will then be roughly 5° high at that time. Through a telescope, you’ll also be able to see that Mercury’s 6”-wide disk is 78 percent lit. Compared to earlier this week, it’s 1” larger but a few percent slimmer in terms of illumination.\n\nAbout 13° above Mercury is Castor, Gemini’s alpha star and one of the Twins’ two heads. Shining at magnitude 1.6, Castor is slightly fainter than Gemini’s beta star, magnitude 1.2 Pollux, which lies about 4.5° to its left as the constellation sets this evening. Compare the colors of these two stars through your optics: Pollux should appear more golden yellow than Castor, which appears more blue-white. Additionally, Castor is an easy-to-split multiple-star system. Its two brightest components, which shine at 2nd and 3rd magnitude, lie a few arcseconds apart. Farther away, some 1.2’ south of this pair, is a third star, shining at 9th magnitude.\n\nEach of these three stars is a binary system as well, although none can be further split by a telescope.\n\nSunrise: 5:31 A.M.\n\nSunset: 8:30 P.M.\n\nMoonrise: 10:59 P.M.\n\nMoonset: 7:11 A.M.\n\nMoon Phase: Waning gibbous (94%)",
    "summary": "The Moon passes 0. 5° south of the magnitude 1. 0 star Spica at 11 A. M. EDT . The pair hangs in the evening sky, located in the south two hours after sunset . Now draw a line between the two and continue following it to the lower left, toward the horizon . There’s a short dark window of about an hour after the Moon sets . This morning, our satellite will be 251,999 miles (405,553 km) away .",
    "authors": [
      "Alison Klesman"
    ],
    "source": "Sky this Week | Astronomy.com",
    "fetched_at": "2025-06-06T17:54:21.724147",
    "summarized_at": "2025-06-06T18:04:45.526881"
  },
  {
    "title": "The Sky This Week from May 30 to June 6: All eyes on Venus",
    "url": "https://www.astronomy.com/the-sky-this-week/the-sky-this-week-from-may-30-to-june-6-2025/",
    "published": "Fri, 30 May 2025 05:00:00 +0000",
    "content": "Earth’s sister planet reaches greatest western elongation and dichotomy as the waxing Moon slides along the ecliptic in the sky this week.\n\nVenus not only reaches greatest western elongation in the sky this week, but dichotomy as well. Dichotomy is the moment the planet appears 50 percent lit; this 2017 image captured the planet when it was 49.9 percent lit. Credit: Shahrin Ahmad (Flickr, BY-NC-SA 2.0)\n\nSky This Week is brought to you in part by Celestron.\n\nFriday, May 30\n\nThe crescent Moon lies in Cancer this evening, just a few degrees from the stunning Beehive Cluster (M44). If it seems that this cluster is mentioned in this column a lot — it is! The Beehive lies close to the ecliptic, the plane of the solar system in which all the major planets orbit. Thus, we see the planets — and our Moon, which also orbits Earth close to the ecliptic — pass by the same regions of the sky over and over again as they move relative to the background stars, including the Beehive.\n\nThis young open cluster is visible with the naked eye and has thus been known since antiquity. It is sometimes called Praesepe, or the Manger. M44 shines at a collective magnitude of 3.7 and spans some 95’, making it almost as large as another famous open cluster: the Pleiades (M45).\n\nTonight, the waxing Moon sits to the lower right of the Beehive as Cancer sinks in the west after sunset. The pair is visible for some three hours after the Sun disappears, offering plenty of time to observe both in binoculars or a telescope if you wish. Our satellite is now roughly 20 percent illuminated, with sunlight brightening its eastern limb. In particular, the dark, circular Mare Crisium should appear striking amid its lighter surroundings. Look also for the large crater Langrenus south of Crisium. This deep crater hosts a distinctive central peak.\n\nSunrise: 5:34 A.M.\n\nSunset: 8:21 P.M.\n\nMoonrise: 8:52 A.M.\n\nMoonset: —\n\nMoon Phase: Waxing crescent (17%)\n\n*Times for sunrise, sunset, moonrise, and moonset are given in local time from 40° N 90° W. The Moon’s illumination is given at 12 P.M. local time from the same location.\n\nSaturday, May 31\n\nVenus reaches its greatest western elongation (46°) from the Sun at midnight EDT. Earth’s sister planet is now visible in the early-morning sky, and today Venus rises in the east at 3:30 A.M. local daylight time — roughly two hours before the Sun. That gives observers plenty of time to view the bright morning planet, now shining at magnitude –4.4.\n\nVenus is now in southeastern Pisces. It’s the brightest object in the sky, impossible to miss. Through a telescope, the planet’s disk stretches 24” and is 49 percent lit. Tomorrow, the planet officially reaches dichotomy, when it is exactly half illuminated. But see what you think this morning — how much of it do you judge is lit? How close or far is it from half?\n\nIn the late 1700s, amateur astronomer Johann Schröter noted that Venus often appeared to reach dichotomy a few days before or after calculations showed it would. Whether it was early or late depended on its elongation — while at western elongation, as it is now, it generally appeared to reach dichotomy a few days later than predicted. Now called the Schröter effect, astronomers still aren’t sure why this occurs, though it’s likely due to optical illusions caused by the way sunlight reflects off the planet’s thick clouds or in the way our eyes perceive the planet through our own atmosphere.\n\nMake sure to return to the morning sky for a few more days to see when you feel Venus truly reaches dichotomy!\n\nSunrise: 5:34 A.M.\n\nSunset: 8:22 P.M.\n\nMoonrise: 10:04 A.M.\n\nMoonset: 12:19 A.M.\n\nMoon Phase: Waxing crescent (26%)\n\nSunday, June 1\n\nVenus officially reaches dichotomy, when the planet is half-lit, today. It appears in the early-morning eastern sky some two hours before the Sun and is well placed for viewing 60 to 90 minutes before sunrise. Take a look through a telescope and see whether you think it is now half-lit, or whether it has a few more days to go.\n\nThe Moon passes 1.4° north of Mars at 6 A.M. EDT; the two are visible together this evening, slowly setting in the western sky and visible for a few hours after sunset. Both now lie in western Leo, with the Moon close to the Lion’s bright heart, Regulus (Alpha [α] Leonis). This magnitude 1.4 star lies some 79 light-years away, making it one of the relatively closer star systems to our Sun. And it is indeed a system of stars: Regulus is a quadruple star. Amateur scopes can generally capture three of the stars in this system, with one companion some 175” away.\n\nMars lies about 8.5° west of the Moon and Regulus, closer to the border of Leo and Cancer. The Red Planet now shines at magnitude 1.2, a bit brighter than Regulus, and gives off a ruddy glow true to its name. Through a telescope, Mars spans just 5”. Any view of its surface features will be fairly impossible for some time, until our orbits bring us closer together late next year.\n\nSunrise: 5:33 A.M.\n\nSunset: 8:23 P.M.\n\nMoonrise: 11:14 A.M.\n\nMoonset: 12:51 A.M.\n\nMoon Phase: Waxing crescent (36%)\n\nMonday, June 2\n\nFirst Quarter Moon occurs late this evening at 11:41 P.M. EDT, with the Moon now near the hindquarters of Leo the Lion.\n\nBut did you know there’s also a Lion Cub in the sky? The smaller constellation Leo Minor lies to the upper right (north) of Leo in the west this evening. Leo Minor appears crouched above its larger counterpart, sandwiched between Leo and Ursa Major. The easiest way to find it is to search the space between two famous asterisms: the Sickle of Leo and the Big Dipper.\n\nFrom magnitude 2.3 Merak, the star that marks the lower righthand corner of the Big Dipper’s cup, draw an imaginary line all the way to Regulus, Leo’s brightest star and the base of the Sickle’s handle. Leo Minor is halfway along that line.\n\nThe Lion Cub doesn’t have an alpha star — instead, its brightest star is magnitude 3.8 46 Leonis Minoris. It does, however, have a beta star, which shines at magnitude 4.2.\n\nSunrise: 5:33 A.M.\n\nSunset: 8:24 P.M.\n\nMoonrise: 12:19 P.M.\n\nMoonset: 1:17 A.M.\n\nMoon Phase: Waxing crescent (46%)\n\nTuesday, June 3\n\nAsteroid 2 Pallas is stationary at 5 P.M. EDT. Rising late this evening in Delphinus the Dolphin, we’ll return to this large main-belt world tomorrow evening. Tonight, we’re taking a detour to observe the waxing Moon.\n\nAlready high in the sky at sunset, the Moon is some 45° high in the southwest an hour after the Sun disappears. Fix your telescope on the center of the Moon, near the terminator dividing lunar night and day. Just south of the lunar equator is a series of three craters, starting with Ptolemaeus. About 95 miles (153 kilometers) wide, its floor appears at first glance quite smooth except for one notable pockmark in the northeast. But Ptolemaeus is actually covered in craterlets that have been buried over time by ejecta from nearby impacts. Study its broad floor to see if you can find any telltale depressions.\n\nJust south of Ptolemaeus is Alphonsus, nearly 70 miles (110 km) wide. This crater hosts a noticeable central peak as well as a north-south ridge spanning its entire width.\n\nSouthernmost of the trio is Arzachel. It is smallest (60 miles [96 km]) and youngest of the three, also hosting a central peak. Compare this crater’s walls and other features to Alphonsus — because Arzachel is younger, it is more sharply defined as it has had less time for impacts both near and far to affect its landscape.\n\nSunrise: 5:33 A.M.\n\nSunset: 8:24 P.M.\n\nMoonrise: 1:22 P.M.\n\nMoonset: 1:39 A.M.\n\nMoon Phase: Waxing gibbous (56%)\n\nWednesday, June 4\n\nNow let’s return to Pallas, visible in the late evening and overnight. Around local midnight, you’ll find this main-belt world some 16° high in the eastern sky, a few degrees east of the four-star lozenge in Delphinus also called Job’s Coffin.\n\nThis small, diamond-shaped asterism is made from four 4th-magnitude stars: Alpha, Beta (β), Gamma (γ), and Delta (δ) Delphini. You’ll find it about 14° east-northeast of bright Altair in Aquila. Once you’ve located Job’s Coffin, slide 6° east with binoculars or a telescope to land on 10th-magnitude Pallas. Previously moving eastward toward the border Delphinus shares with Pegasus, Pallas will now do an about-face and begin moving westward against the background sky, tracking back deeper into Delphinus once more.\n\nWhile you’re in the area, if you’re using even a small scope make sure to skip back over to Gamma Del, the easternmost star in the Coffin. Through a telescope, this star can be split into its two binary components, which shine and 4th and 5th magnitudes. They are 10” apart.\n\nSunrise: 5:32 A.M.\n\nSunset: 8:25 P.M.\n\nMoonrise: 2:22 P.M.\n\nMoonset: 1:58 A.M.\n\nMoon Phase: Waxing gibbous (65%)\n\nThursday, June 5\n\nNow rising in the east after sunset is the famous Summer Triangle, so called because it sits high overhead on summer nights. As we head for the Northern Hemisphere summer solstice later this month, the three stars that make up this asterism will rise earlier and earlier each night.\n\nTonight around 11 P.M. local daylight time you’ll see the Summer Triangle some 30° high in the east. The lowest star, Altair, shines at magnitude 0.8 in Aquila the Eagle. To its upper left is magnitude 1.3 Deneb, which marks the tail of Cygnus the Swan. To the upper right of Deneb is Vega in Lyra the Lyre. At magnitude 0, it is the brightest star in the Summer Triangle and the highest as it is rising.\n\nIn all, the Summer Triangle covers some 415 square degrees and encompasses a portion of the plane of the Milky Way, our galaxy. The brightest region of the galaxy visible within the Summer Triangle is the Cygnus Star Cloud; also visible is the dark Great Rift, made up of light-blocking dust.\n\nSunrise: 5:32 A.M.\n\nSunset: 8:26 P.M.\n\nMoonrise: 3:22 P.M.\n\nMoonset: 2:18 A.M.\n\nMoon Phase: Waxing gibbous (74%)\n\nThe small but easy-to-see constellation Corvus the Crow occupies 184 square degrees — that’s only 0.45 percent of the sky. Credit: Astronomy: Roen Kelly.\n\nFriday, June 6\n\nThe Moon passes 0.5° south of Spica at 11 A.M. EDT. The pair hangs in the evening sky, located in the south an hour after sunset.\n\nBy this evening, the Moon has moved some 6.3° southeast of Spica, the star that anchors Virgo the Maiden as its alpha luminary. Spica is magnitude 1 and sits close to the ecliptic, the plane of the solar system, which is also near the Moon’s orbit through our sky. At times, the Moon will pass in front of Spica from our earthly point of view, but not this month.\n\nTo the lower right of Spica is a quadrilateral of four 3rd-magnitude stars. This is the outline of Corvus the Crow, a relatively small and overlooked constellation. If you’ve got a small telescope, skim over to Corvus’ delta star (also called Algorab) some 14.5° southwest of Spica (the closest of the four to Spica). You’ll find Delta Corvi is a nice double system, showing off a 3rd-magnitude blue-white primary and an orangey 9th-magnitude secondary. They’re about 24” apart, easily split and far enough apart that their colors are obvious, even given their difference in magnitude.\n\nSunrise: 5:32 A.M.\n\nSunset: 8:26 P.M.\n\nMoonrise: 4:22 P.M.\n\nMoonset: 2:38 A.M.\n\nMoon Phase: Waxing gibbous (82%)",
    "summary": "Venus reaches greatest western elongation in the sky this week, but dichotomy as well . This 2017 image captured the planet when it was 49.9% lit . The crescent Moon lies in Cancer this evening, just a few degrees from the stunning Beehive Cluster (M44) Our satellite is now roughly 20 percent illuminated, with sunlight brightening its eastern limb .",
    "authors": [
      "Alison Klesman"
    ],
    "source": "Sky this Week | Astronomy.com",
    "fetched_at": "2025-06-06T17:54:21.724149",
    "summarized_at": "2025-06-06T18:05:11.362865"
  },
  {
    "title": "Michael’s Miscellany: All About Orion",
    "url": "https://www.astronomy.com/astronomy-for-beginners/michaels-miscellany-all-about-orion/",
    "published": "Wed, 04 Jun 2025 17:50:17 +0000",
    "content": "This new astronomy book will help visually impaired kids understand the constellations.\n\nAll About Orion comes in two versions: paperback and spiral bound. Both have tactile constellations. The spiral bound version adds braille text. Credit: Michael E. Bakich\n\nIt’s difficult for amateur astronomers to fully share the wonders of the night sky with a visually impaired child. Well, that task has gotten a bit easier thanks to All About Orion, the new book by Dean Regas. This large (8½” by 11″) book contains 24 pages full of information about most people’s favorite constellation. It’s published by Clovernook Press, a division of Clovernook Center for the Blind and Visually Impaired in Cincinnati.\n\nThe author\n\nDean Regas formerly was the astronomer at the Cincinnati Observatory. He’s a well-regarded public speaker, author of six books, and the celebrity behind the “Looking Up” podcast.\n\nContents\n\nRegas first defines what a constellation is and then offers a short description of how to identify Orion’s shape. Following are single-page chapters about three star patterns directly related to the mythology of Orion: “The Seven Sisters,” “Scorpius the Scorpion,” and “Taurus the Bull.”\n\nFive more chapters — “The Three Belt Stars,” “Betelgeuse,” “Other Brilliant Stars,” “The Orion Nebula,” and “The Horsehead Nebula” — describe the brightest stars and the two most famous deep-sky objects in the constellation.\n\nTwo more chapters, “Create Your Own Constellation” and “Make Your Own Starry Story” allow young readers a bit of creative interaction.\n\nBut what sets the book apart is that the publisher has included translucent pages with raised dots that anyone who knows braille can read. The paperback book has pages that allow someone to trace the patterns of the objects discussed on the previous page. The spiral bound version adds the complete text in braille.\n\nThis would be a wonderful addition to any child’s library, and will be an important one for visually impaired students. Nice job, Dean!",
    "summary": "All About Orion comes in two versions: paperback and spiral bound . Both have tactile constellations. The spiral bound version adds braille text . The large (812” by 11′′) book contains 24 pages full of information . the paperback book has translucent pages with raised dots that anyone who knows braille can read . The spiral bound version adds the complete text in braille . This would be a wonderful addition to any child’s library .",
    "authors": [
      "Michael E. Bakich"
    ],
    "source": "News | Astronomy.com",
    "fetched_at": "2025-06-06T17:54:21.724150",
    "summarized_at": "2025-06-06T18:05:14.745944"
  },
  {
    "title": "Deep-Sky Dreams: Open cluster NGC 225",
    "url": "https://www.astronomy.com/observing/deep-sky-dreams-open-cluster-ngc-225/",
    "published": "Mon, 02 Jun 2025 20:43:15 +0000",
    "content": "NGC 225 in Cassiopeia is also known as the Sailboat Cluster or the Halloween Cat.\n\nThe open cluster NGC 225, sometimes called the Sailboat Cluster, and the surrounding region in Cassiopeia. Credit: Hunter Wilson\n\nIf you have the time and clear sky to the north, you might want to check out an open cluster that is seldom observed. An “average joe” open cluster in Cassiopeia nonetheless appears fairly bright and presents an almost circular pattern of stars.\n\nThis is NGC 225, sometimes called the Sailboat Cluster, or more recently the Halloween Cat for a group of stars within the cluster.\n\nNGC 225 is a relatively young cluster at roughly 150 million years, and lies about 2,200 light-years away.\n\nIts total magnitude is bright enough to make it visible in binoculars, at 7.0. The cluster spreads over 12’, about a third the diameter of the Full Moon.\n\nOther interesting features are intertwined with the same low-power field of view. A faint reflection nebula, van den Bergh 4, is associated with the cluster. Nearby lies a prominent dark nebula, LDN 1302.",
    "summary": "NGC 225 in Cassiopeia is also known as the Sailboat Cluster or the Halloween Cat . An “average joe” open cluster appears fairly bright and presents an almost circular pattern of stars . The cluster spreads over 12’, about a third the diameter of the Full Moon .",
    "authors": [
      "David J. Eicher"
    ],
    "source": "News | Astronomy.com",
    "fetched_at": "2025-06-06T17:54:21.724151",
    "summarized_at": "2025-06-06T18:05:17.001339"
  },
  {
    "title": "One of the best star projectors on the market — the Pococo Galaxy Star Projector — is at its lowest ever price ahead of Father's Day",
    "url": "https://www.space.com/technology/pococo-galaxy-star-projector-28-percent-off-lowest-price-pre-fathers-day",
    "published": "Fri, 06 Jun 2025 11:00:09 +0000",
    "content": "If you're looking for a deal in time for Father's Day, and you want to beat the inevitable Prime Day rush, this is the offer for you. The Pococo Galaxy Star Projector is one of the best star projectors on the market and is currently 28% off — its lowest-ever price.\n\nSave 28% and get the lowest-ever price on the Pococo Galaxy Star Projector when you grab it on Amazon.\n\nFollowing our Pococo Galaxy Star Projector review, we found that it's the best rechargeable model on the market and has quality to rival the best premium projectors available. Its rechargeable battery means you can use it anywhere, and it uses LED lights to project realistic, vivid imagery on a surface up to 12 square meters. There's a lot to like about this star projector and it's currently 20% off in a limited-time deal. You can also claim a further 10% discount, taking the overall savings to 28% off the original price.\n\nPococo Galaxy Star Projector: was $100 now $72 at Amazon The Pococo Galaxy Star Projector uses LED lights to project realistic, bright, vivid images onto a surface of up to 12 square meters. It also features a rechargeable battery, meaning you can take it with you anywhere and it has a near-silent operation with a sleeper timer, making it ideal for ambience and relaxation. Note: This will arrive in time for Father's Day and is a great option to beat the inevitable Prime Day sales rush. This projector is 20% off, but you can redeem a further 10% discount to maximize the savings.\n\nWe're constantly checking the best prices on our pages for big discounts on the best telescopes, binoculars, star projectors, cameras, drones, Lego, streaming and more.\n\nImage 1 of 5 The Pococo Galaxy Star Projector is one of the best on the market and it's currently at its lowest-ever price. (Image credit: Tantse Walter) (Image credit: Tantse Walter) (Image credit: Tantse Walter) (Image credit: Tantse Walter) (Image credit: Tantse Walter)\n\nWith Father's Day coming on June 15 and Amazon Prime Day historically not too far behind, this could be the perfect deal if you're looking for something to arrive in time, or you don't want to run the risk of not finding as good an offer, or the retailer running out of stock. The Pococo Galaxy Star Projector is a more affordable model that rivals some of the premium options for quality. We'll get into how it achieves that.\n\nThe rechargeable battery means it doesn't need a power socket to work, unlike some premium models. It uses LED bulbs, which produce bright and high-quality projections onto a surface up to 12 square meters. The use of realistic images also separates it from a lot of the market, as many star projectors feature star or nebulae-like patterns, but not realistic imagery. We also like its near-silent motor, which doesn't disturb the ambience and a sleeper timer which can be set to 15, 30 or 60 minutes, but will automatically activate after two hours, so you don't have to worry about it running through the night.\n\nOne of the best star projectors on the market at its lowest-ever price and it arrives in time for Father's Day, what's not to like?\n\nKey features: Rechargeable battery, LED bulbs, rotation possible, realistic imagery, additional disks available, disks compatible with some other projectors, lowest-ever price, near-silent motor, sleeper timer.\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nPrice history: Before today's deal, the lowest price we saw for the Pococo Galaxy Star Projector was $79.99, which is the price you would pay before redeeming the additional 10%. It usually retails for $100 when not on sale.\n\nReviews consensus: Rated as the best rechargeable star projector, the Pococo Galaxy Star Projector is an affordable model that can be taken on the go and rival some of the premium options. Our only dislike with it is that it has some questionable marketing.\n\nFeatured in guides: Best star projectors\n\n✅ Buy it if: You want an affordable premium-feel star projector that you can use on the go and will project realistic imagery.\n\n❌ Don't buy it if: You either want the best of the best, the Sega Toys HomeStar Flux, or you're on a budget, in which case we recommend the Astronaut Starry Sky Star Projector.\n\nCheck out our other guides to the best telescopes, binoculars, cameras, star projectors, drones, lego and much more.",
    "summary": "The Pococo Galaxy Star Projector is one of the best star projectors on the market and is currently 28% off . It's rechargeable battery means you can use it anywhere, and it uses LED lights to project realistic, vivid imagery on a surface up to 12 square meters . This projector is 20% off, but you can redeem a further 10% discount to maximize the savings . We're constantly checking the best prices on our pages for big discounts on the best telescopes, binoculars, starprojector The Pococo Galaxy Star Projector is currently at its lowest-ever price . The rechargeable battery means it doesn't need a power socket to work . It uses LED bulbs, which produce bright and high-quality projections onto a surface up to 12 square meters . The Pococo Galaxy Star Projector is one of the best rechargeable star projectors on the market at its lowest-ever price . It comes in time for Father's Day, what's not to like? Get the Space. com Newsletter Breaking space news, latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors Price history: Before today's deal, the lowest price we saw for the pococo",
    "authors": [
      "Alexander Cox",
      "E-Commerce Staff Writer",
      "Social Links Navigation"
    ],
    "source": "Latest from Space.com",
    "fetched_at": "2025-06-06T17:54:21.724152",
    "summarized_at": "2025-06-06T18:05:26.879437"
  },
  {
    "title": "'Predator: Killer of Killers' is a battle across history that doesn't dwell on the franchise's past",
    "url": "https://www.space.com/entertainment/space-movies-shows/predator-killer-of-killers-is-a-battle-across-history-that-doesnt-dwell-on-the-franchises-past",
    "published": "Fri, 06 Jun 2025 11:00:00 +0000",
    "content": "There are plenty of upcoming sci-fi movies we're keeping tabs on this year, and those of us who aren't afraid of getting a little bloody can't wait for Predator: Badlands , the next theatrical installment in the long-running series. Hulu's Predator: Killer of Killers , now available on the platform and Disney Plus globally, on the other hand, has been a huge surprise arrival, and I'm happy to report it's among the franchise's best and made me excited about what's next.\n\nThe new movie, mostly marketed as a three-chapter animated anthology, takes us to the times of Vikings, ninja, samurai, and WWII flying aces. The alien 'tourists' have been visiting Earth for a very long time, as Prey (2022), Predator 2 (1990), and the first Alien vs. Predator (2004) suggested. That said, Predator: Killer of Killers doesn't just have fun with all the 'Wouldn't it be cool if a Predator fought (x)?' scenarios; it also enlarges the larger mythology surrounding the hunters and even sets the stage for more ambitious stories.\n\nMild spoilers ahead for Predator: Killer of Killers. We'll also assume that you've watched all the previous Predator movies.... if not, check out our Predator movies in order list.\n\n(Image credit: Hulu)\n\nWith modern-day Predator movies in the rear view, it seems Dan Trachtenberg's full attention is on expanding the horizons of the series and trying to keep fans on their toes. We're not just throwing a Predator into a new setting or trying to make things more complicated than they needed to be (I'm looking at you, Shane Black ). If Trachtenberg's two excellent Predator projects so far have told us anything, it's that diehards of the wider lore in comic books and video games will be eating well for the foreseeable future.\n\nWhereas past filmmakers tried to replicate or honor the 1987 original to a fault, the new shepherd of the franchise and his writing partners – co-writers Patrick Aison (Prey) & Micho Robert Rutare (Killers of Killers) – are more interested in gradually lifting the veil covering the universe of possibilities first suggested by series creators Jim and John Thomas in the vastly underrated second movie. Prey, while structurally similar to the classics, already took the design of the creature, its arsenal, and the relationship with Amber Midthunder's Naru in a slightly different direction. 'Who's really the prey?' kept the movie thematically interesting and refreshing enough so we didn't feel bothered by the 'If it bleeds, we can kill it' line drop.\n\n(Image credit: Hulu)\n\nPredator: Killer of Killers makes its universe-building intentions clear from the very beginning: \"Go forth among the stars and seek only the strongest prey. They shall be your trophy. Become the killer of killers.\" This fictional quote is even confirmed to come from the in-universe Yautja Codex (yes, they finally used 'Yautja' in a movie), mysterious calendar date included. With Badlands set to closely follow the adventures of a young Predator hunter trying to prove himself, this feels like only the beginning for an on-screen expansion of these aliens' history and culture. These are no longer simple monster features with slight tints of horror. Watch out for the brutal violence peppered throughout this journey across three eras, though, as this may be the series' goriest entry yet.\n\nEven the way Killer of Killers' Predator-less sequences are executed set it apart from what's come before: The Viking revenge tale we get to see before all hell breaks loose is engaging on its own; the brotherly drama driving the second short packs a punch; and the 'aspiring fighter pilot' premise at the center of the last chapter could've fueled a Top Gun-like period piece movie. Things just happen to get more enjoyable when the Yautja hunters show up and start using slicing and dicing. Stylish animation aside, the joyful carnage feels weighty because we care about what happens before it. This is exactly why Predator and Prey worked so well, and something the other flicks forgot about for the most part.\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\n(Image credit: Hulu)\n\nThe different settings are also used to great effect to reshape the Predator-on-human action we're ultimately showing up for. Freya and her son Anders have to get creative to defeat the 'Grendel' with little more than shields and chains; the twins Kenji and Kiyoshi use every ninja and samurai trick they know to go full melee against a Predator that dwarfs them; and that WWII-set section is going to please dogfight enjoyers with its plain but fitting UFO twist. The movie changes gears before you even begin to feel tired, and Trachtenberg and Rutare were smart enough to keep things clean and agile when it came to character development and themes.\n\nPerhaps that's Killer of Killers' biggest achievement beyond successfully translating the property into gorgeous, Arcane -like animation: As much heavy lifting as it does for the franchise's potential future, it's not a lore-heavy, bloated mess. 'Show, don't tell' feels especially relevant here. Even as the story reaches a surprising final act that Disney has kept the lid on, I kept thinking this could be a perfectly valid first step into the series for newbies who are enticed by the animated twist.\n\n(Image credit: Hulu)\n\nWith Predator: Badlands looking to do something entirely different and venturing into a fictional future that appears to be part of the Alien movie timeline , yet another 'safe' Predator movie would've sufficed, but 20th Century Studios is supporting a renewed vision for a franchise that showed severe signs of fatigue only seven years ago.",
    "summary": "The new movie, mostly marketed as a three-chapter animated anthology, takes us to the times of Vikings, ninja, samurai, and WWII flying aces . The alien 'tourists' have been visiting Earth for a very long time, as Prey (2022), Predator 2 (1990), and the first Alien vs. predator (2004) suggested . Trachtenberg's two excellent Predator projects so far have told us anything, it's that diehards of the wider lore in comic books and video games will be eating well for the foreseeable future . The new shepherd of the franchise and his writing partners are more interested in gradually lifting the veil covering the universe of possibilities first suggested by series creators Jim and John Thomas . Prey, while structurally similar to the classics, already took the design of the creature, its arsenal, and the relationship with Amber Mid The Viking revenge tale we get to see before all hell breaks loose is engaging on its own; the brotherly drama driving the second short packs a punch; and the 'aspiring fighter pilot' premise at the center of the last chapter could've fueled a Top Gun-like period piece movie . Get the Space. com Newsletter Breaking space news, latest updates on rocket launches, skywatching events and more! The movie changes gears before you even begin to feel tired . Trachtenberg and Rutare were smart enough to keep things clean and agile . As much heavy lifting as it does for the franchise's potential future, it's not a lore-heavy, bloated mess .",
    "authors": [
      "Fran Ruiz"
    ],
    "source": "Latest from Space.com",
    "fetched_at": "2025-06-06T17:54:21.724153",
    "summarized_at": "2025-06-06T18:05:39.371316"
  }
]