[
  {
    "title": "How a Childhood Telescope Launched a NASA Career",
    "url": "https://www.nasa.gov/image-article/childhood-telescope-launched-career-for-christina-zeringue/",
    "published": "Wed, 04 Jun 2025 13:59:39 +0000",
    "content": "Christina Zeringue is the chief safety and mission assurance officer at NASA’s Stennis Space Center. She is responsible for the safety and mission success of all activities, including rocket propulsion testing and operation of the NASA Stennis federal city. NASA/Danny Nowlin\n\nChristina Zeringue remembers being 10 years old, looking to the sky through her new telescope to view the Moon and planets on Christmas night. It opened her eyes to space and inspired her journey from the backyard to NASA’s Stennis Space Center near Bay St. Louis, Mississippi.\n\n“I became fascinated with astronomy and learning about stars and constellations, the solar system and planetary orbits, solar and lunar eclipses, and challenging myself to find stars and nebula at different distances from Earth,” Zeringue said. “I was able to do and learn so much just from my own yard.”\n\nShe became obsessed with following the development and images produced from the Hubble Space Telescope, which launched on a space shuttle that featured three main engines tested at NASA Stennis.\n\nZeringue desired to learn more about the universe and find a way to be part of the effort to continue exploring. The Kenner, Louisiana, native ultimately made her way to NASA Stennis following graduation from the University of New Orleans.\n\nAs the NASA Stennis chief safety and mission assurance officer, Zeringue is responsible for safety and mission success of all site activities. These include both rocket propulsion testing and operation of the NASA Stennis federal city, where NASA and more than 50 federal, state, academic, public, and private aerospace, technology, and research organizations located onsite share in operating costs while pursuing individual missions.\n\nChristina Zeringue enjoys viewing the partial solar eclipse on Oct. 14, 2023, from Slidell, Louisiana. NASA/Danny Nowlin\n\n“I have a broad range of responsibilities, which allows me to work with many talented people, pushes me to learn and develop new skills, and keeps my work interesting every day,” Zeringue said.\n\nZeringue’s work has supported NASA’s Artemis campaign to return astronauts to the Moon through her contributions to RS-25 engine testing and Green Run testing of NASA’s SLS (Space Launch System) core stage ahead of the successful launch of Artemis I.\n\nThe Pearl River, Louisiana, resident often encounters engineering or safety challenges where there is not a clear answer to the solution.\n\n“We work together to understand new problems, determine the best course of action, and create new processes and ways to handle every challenge,” she said.\n\nIn total, Zeringue has worked 28 years at NASA Stennis – 14 as a contractor and 14 with NASA.\n\nAs a contractor, Zeringue initially worked as test article engineer for the Space Shuttle Main Engine Program. She followed that by serving as the quality systems manager, responsible for the quality engineering and configuration management of various engine systems, such as the space shuttle main engine, the RS-68 engine or Delta IV vehicles, and the J-2X upper stage engine.\n\nZeringue transitioned to NASA in 2011, first as a facility systems safety engineer and then as chief of the operations support division within the NASA Stennis Safety and Mission Assurance Directorate.\n\nHer proudest career moment came early when working on final inspection of a new high pressure fuel turbopump. She noted a piece of contamination lodged behind the turbine shroud, which had been missed in previous inspections. Ultimately, the part was returned for disassembly before its next flight.\n\n“While our post-test inspections can sometimes become routine, that day still stands out to me as a way that I really knew I directly contributed to the safety of our astronauts,” she said.\n\nFrom the time Zeringue first looked through her new telescope, to her role as NASA Stennis chief safety and mission assurance officer, each moment along the way has contributed to the advice Zeringue shares with anyone considering a career with NASA. “Stay curious, invest in your own development, share your expertise with others, and try something new every day,” she said.",
    "summary": "",
    "authors": [
      "Latoya Dean"
    ],
    "source": "NASA",
    "fetched_at": "2025-06-04T21:04:29.941831"
  },
  {
    "title": "I Am Artemis: Lili Villarreal",
    "url": "https://www.nasa.gov/centers-and-facilities/kennedy/i-am-artemis-lili-villarreal/",
    "published": "Wed, 04 Jun 2025 13:35:00 +0000",
    "content": "Listen to this audio excerpt from Liliana Villarreal, Artemis Landing & Recovery Director:\n\n\n\n\n\n\n\n\n\n\n\n\n\n0:00 / 0:00 Your browser does not support the audio element.\n\nLili Villarreal fell in love with space exploration from an early age when she and her family visited the Kennedy Space Center Visitor Complex in Florida. So, it should come as no surprise that when the opportunity came for her to start working on NASA’s Artemis missions to explore the Moon and build the foundation for the first crewed mission to Mars, she jumped at it.\n\nI was like, ‘Wow, we're going back to the Moon. I mean, how cool would it be to be at the beginning stages of that?' Liliana Villareal Artemis Landing & Recovery Director\n\nShe currently serves as the Artemis Landing and Recovery Director, helping retrieve the astronauts and Orion spacecraft after they splash down in the Pacific Ocean following their mission in space.\n\nOriginally from Cartagena, Colombia, Villarreal moved to Miami, Florida, when she was 10 years old with the goal of one day entering the aerospace industry. In 2007, her dream came true, and she became a part of the NASA team.\n\nPrior to becoming the landing and recovery director, Villarreal served as the deputy flow director for the Artemis I mission, responsible for the integration, stacking, and testing of the SLS (Space Launch System) rocket and Orion spacecraft inside the Vehicle Assembly Building at the agency’s Kennedy Space Center.\n\nCliff Lanham, fourth from left, ground operations manager with Exploration Ground Systems (EGS), passes the baton to Charlie Blackwell-Thompson, Artemis I launch director, inside the Vehicle Assembly Building at NASA’s Kennedy Space Center in Florida on March 16, 2022. Joining them from left, are Stacey Bagg, Matt Czech, and Liliana Villareal, with EGS. Next to Blackwell-Thomson are Jeremy Graeber, deputy launch director, and Teresa Annulis.\n\nNASA/Glenn Benson\n\n“I kind of came in about a couple of years before we started processing Artemis I,” Villarreal said. “It took a while to get to the good parts of operations where it’s like, ‘Oh my god, we have everything here, and we’re starting to put everything together. And every day is a different day. Every day we have to figure out, ‘OK, what happened? How are we going to solve it?’ That’s the fun part about being an engineer out here.”\n\nThroughout her NASA career, she’s also had the opportunity to work in the operations division for the International Space Station Program.\n\nEvery day I work on the Artemis missions, I imagine how the people who worked on Apollo felt because we are where they were back then. Liliana Villareal Artemis Landing & Recovery Director\n\nCurrently, she and the team are training for Artemis II – the first crewed mission under Artemis to send four astronauts around the Moon and back. Part of the training includes rehearsing the steps and procedures to make sure they’re ready for crewed flights. This includes conducting underway recovery tests where NASA and U.S. Navy teams practice retrieving astronauts from a representative version of Orion at sea and bringing them and the spacecraft back to the ship.\n\n“I think it’s an amazing thing what we’re doing for humanity,” Villarreal said. “It’s going to better humanity, and it’s a steppingstone to eventually us living in other worlds. And I get to be part of that. You get to be part of that. How cool is that?”",
    "summary": "",
    "authors": [
      "Antonia Jaramillo",
      ".Hds-Author-Thumbnail Img Height",
      "Width"
    ],
    "source": "NASA",
    "fetched_at": "2025-06-04T21:04:29.941840"
  },
  {
    "title": "The Sky This Week from May 30 to June 6: All eyes on Venus",
    "url": "https://www.astronomy.com/the-sky-this-week/the-sky-this-week-from-may-30-to-june-6-2025/",
    "published": "Fri, 30 May 2025 05:00:00 +0000",
    "content": "Earth’s sister planet reaches greatest western elongation and dichotomy as the waxing Moon slides along the ecliptic in the sky this week.\n\nVenus not only reaches greatest western elongation in the sky this week, but dichotomy as well. Dichotomy is the moment the planet appears 50 percent lit; this 2017 image captured the planet when it was 49.9 percent lit. Credit: Shahrin Ahmad (Flickr, BY-NC-SA 2.0)\n\nSky This Week is brought to you in part by Celestron.\n\nFriday, May 30\n\nThe crescent Moon lies in Cancer this evening, just a few degrees from the stunning Beehive Cluster (M44). If it seems that this cluster is mentioned in this column a lot — it is! The Beehive lies close to the ecliptic, the plane of the solar system in which all the major planets orbit. Thus, we see the planets — and our Moon, which also orbits Earth close to the ecliptic — pass by the same regions of the sky over and over again as they move relative to the background stars, including the Beehive.\n\nThis young open cluster is visible with the naked eye and has thus been known since antiquity. It is sometimes called Praesepe, or the Manger. M44 shines at a collective magnitude of 3.7 and spans some 95’, making it almost as large as another famous open cluster: the Pleiades (M45).\n\nTonight, the waxing Moon sits to the lower right of the Beehive as Cancer sinks in the west after sunset. The pair is visible for some three hours after the Sun disappears, offering plenty of time to observe both in binoculars or a telescope if you wish. Our satellite is now roughly 20 percent illuminated, with sunlight brightening its eastern limb. In particular, the dark, circular Mare Crisium should appear striking amid its lighter surroundings. Look also for the large crater Langrenus south of Crisium. This deep crater hosts a distinctive central peak.\n\nSunrise: 5:34 A.M.\n\nSunset: 8:21 P.M.\n\nMoonrise: 8:52 A.M.\n\nMoonset: —\n\nMoon Phase: Waxing crescent (17%)\n\n*Times for sunrise, sunset, moonrise, and moonset are given in local time from 40° N 90° W. The Moon’s illumination is given at 12 P.M. local time from the same location.\n\nSaturday, May 31\n\nVenus reaches its greatest western elongation (46°) from the Sun at midnight EDT. Earth’s sister planet is now visible in the early-morning sky, and today Venus rises in the east at 3:30 A.M. local daylight time — roughly two hours before the Sun. That gives observers plenty of time to view the bright morning planet, now shining at magnitude –4.4.\n\nVenus is now in southeastern Pisces. It’s the brightest object in the sky, impossible to miss. Through a telescope, the planet’s disk stretches 24” and is 49 percent lit. Tomorrow, the planet officially reaches dichotomy, when it is exactly half illuminated. But see what you think this morning — how much of it do you judge is lit? How close or far is it from half?\n\nIn the late 1700s, amateur astronomer Johann Schröter noted that Venus often appeared to reach dichotomy a few days before or after calculations showed it would. Whether it was early or late depended on its elongation — while at western elongation, as it is now, it generally appeared to reach dichotomy a few days later than predicted. Now called the Schröter effect, astronomers still aren’t sure why this occurs, though it’s likely due to optical illusions caused by the way sunlight reflects off the planet’s thick clouds or in the way our eyes perceive the planet through our own atmosphere.\n\nMake sure to return to the morning sky for a few more days to see when you feel Venus truly reaches dichotomy!\n\nSunrise: 5:34 A.M.\n\nSunset: 8:22 P.M.\n\nMoonrise: 10:04 A.M.\n\nMoonset: 12:19 A.M.\n\nMoon Phase: Waxing crescent (26%)\n\nSunday, June 1\n\nVenus officially reaches dichotomy, when the planet is half-lit, today. It appears in the early-morning eastern sky some two hours before the Sun and is well placed for viewing 60 to 90 minutes before sunrise. Take a look through a telescope and see whether you think it is now half-lit, or whether it has a few more days to go.\n\nThe Moon passes 1.4° north of Mars at 6 A.M. EDT; the two are visible together this evening, slowly setting in the western sky and visible for a few hours after sunset. Both now lie in western Leo, with the Moon close to the Lion’s bright heart, Regulus (Alpha [α] Leonis). This magnitude 1.4 star lies some 79 light-years away, making it one of the relatively closer star systems to our Sun. And it is indeed a system of stars: Regulus is a quadruple star. Amateur scopes can generally capture three of the stars in this system, with one companion some 175” away.\n\nMars lies about 8.5° west of the Moon and Regulus, closer to the border of Leo and Cancer. The Red Planet now shines at magnitude 1.2, a bit brighter than Regulus, and gives off a ruddy glow true to its name. Through a telescope, Mars spans just 5”. Any view of its surface features will be fairly impossible for some time, until our orbits bring us closer together late next year.\n\nSunrise: 5:33 A.M.\n\nSunset: 8:23 P.M.\n\nMoonrise: 11:14 A.M.\n\nMoonset: 12:51 A.M.\n\nMoon Phase: Waxing crescent (36%)\n\nMonday, June 2\n\nFirst Quarter Moon occurs late this evening at 11:41 P.M. EDT, with the Moon now near the hindquarters of Leo the Lion.\n\nBut did you know there’s also a Lion Cub in the sky? The smaller constellation Leo Minor lies to the upper right (north) of Leo in the west this evening. Leo Minor appears crouched above its larger counterpart, sandwiched between Leo and Ursa Major. The easiest way to find it is to search the space between two famous asterisms: the Sickle of Leo and the Big Dipper.\n\nFrom magnitude 2.3 Merak, the star that marks the lower righthand corner of the Big Dipper’s cup, draw an imaginary line all the way to Regulus, Leo’s brightest star and the base of the Sickle’s handle. Leo Minor is halfway along that line.\n\nThe Lion Cub doesn’t have an alpha star — instead, its brightest star is magnitude 3.8 46 Leonis Minoris. It does, however, have a beta star, which shines at magnitude 4.2.\n\nSunrise: 5:33 A.M.\n\nSunset: 8:24 P.M.\n\nMoonrise: 12:19 P.M.\n\nMoonset: 1:17 A.M.\n\nMoon Phase: Waxing crescent (46%)\n\nTuesday, June 3\n\nAsteroid 2 Pallas is stationary at 5 P.M. EDT. Rising late this evening in Delphinus the Dolphin, we’ll return to this large main-belt world tomorrow evening. Tonight, we’re taking a detour to observe the waxing Moon.\n\nAlready high in the sky at sunset, the Moon is some 45° high in the southwest an hour after the Sun disappears. Fix your telescope on the center of the Moon, near the terminator dividing lunar night and day. Just south of the lunar equator is a series of three craters, starting with Ptolemaeus. About 95 miles (153 kilometers) wide, its floor appears at first glance quite smooth except for one notable pockmark in the northeast. But Ptolemaeus is actually covered in craterlets that have been buried over time by ejecta from nearby impacts. Study its broad floor to see if you can find any telltale depressions.\n\nJust south of Ptolemaeus is Alphonsus, nearly 70 miles (110 km) wide. This crater hosts a noticeable central peak as well as a north-south ridge spanning its entire width.\n\nSouthernmost of the trio is Arzachel. It is smallest (60 miles [96 km]) and youngest of the three, also hosting a central peak. Compare this crater’s walls and other features to Alphonsus — because Arzachel is younger, it is more sharply defined as it has had less time for impacts both near and far to affect its landscape.\n\nSunrise: 5:33 A.M.\n\nSunset: 8:24 P.M.\n\nMoonrise: 1:22 P.M.\n\nMoonset: 1:39 A.M.\n\nMoon Phase: Waxing gibbous (56%)\n\nWednesday, June 4\n\nNow let’s return to Pallas, visible in the late evening and overnight. Around local midnight, you’ll find this main-belt world some 16° high in the eastern sky, a few degrees east of the four-star lozenge in Delphinus also called Job’s Coffin.\n\nThis small, diamond-shaped asterism is made from four 4th-magnitude stars: Alpha, Beta (β), Gamma (γ), and Delta (δ) Delphini. You’ll find it about 14° east-northeast of bright Altair in Aquila. Once you’ve located Job’s Coffin, slide 6° east with binoculars or a telescope to land on 10th-magnitude Pallas. Previously moving eastward toward the border Delphinus shares with Pegasus, Pallas will now do an about-face and begin moving westward against the background sky, tracking back deeper into Delphinus once more.\n\nWhile you’re in the area, if you’re using even a small scope make sure to skip back over to Gamma Del, the easternmost star in the Coffin. Through a telescope, this star can be split into its two binary components, which shine and 4th and 5th magnitudes. They are 10” apart.\n\nSunrise: 5:32 A.M.\n\nSunset: 8:25 P.M.\n\nMoonrise: 2:22 P.M.\n\nMoonset: 1:58 A.M.\n\nMoon Phase: Waxing gibbous (65%)\n\nThursday, June 5\n\nNow rising in the east after sunset is the famous Summer Triangle, so called because it sits high overhead on summer nights. As we head for the Northern Hemisphere summer solstice later this month, the three stars that make up this asterism will rise earlier and earlier each night.\n\nTonight around 11 P.M. local daylight time you’ll see the Summer Triangle some 30° high in the east. The lowest star, Altair, shines at magnitude 0.8 in Aquila the Eagle. To its upper left is magnitude 1.3 Deneb, which marks the tail of Cygnus the Swan. To the upper right of Deneb is Vega in Lyra the Lyre. At magnitude 0, it is the brightest star in the Summer Triangle and the highest as it is rising.\n\nIn all, the Summer Triangle covers some 415 square degrees and encompasses a portion of the plane of the Milky Way, our galaxy. The brightest region of the galaxy visible within the Summer Triangle is the Cygnus Star Cloud; also visible is the dark Great Rift, made up of light-blocking dust.\n\nSunrise: 5:32 A.M.\n\nSunset: 8:26 P.M.\n\nMoonrise: 3:22 P.M.\n\nMoonset: 2:18 A.M.\n\nMoon Phase: Waxing gibbous (74%)\n\nThe small but easy-to-see constellation Corvus the Crow occupies 184 square degrees — that’s only 0.45 percent of the sky. Credit: Astronomy: Roen Kelly.\n\nFriday, June 6\n\nThe Moon passes 0.5° south of Spica at 11 A.M. EDT. The pair hangs in the evening sky, located in the south an hour after sunset.\n\nBy this evening, the Moon has moved some 6.3° southeast of Spica, the star that anchors Virgo the Maiden as its alpha luminary. Spica is magnitude 1 and sits close to the ecliptic, the plane of the solar system, which is also near the Moon’s orbit through our sky. At times, the Moon will pass in front of Spica from our earthly point of view, but not this month.\n\nTo the lower right of Spica is a quadrilateral of four 3rd-magnitude stars. This is the outline of Corvus the Crow, a relatively small and overlooked constellation. If you’ve got a small telescope, skim over to Corvus’ delta star (also called Algorab) some 14.5° southwest of Spica (the closest of the four to Spica). You’ll find Delta Corvi is a nice double system, showing off a 3rd-magnitude blue-white primary and an orangey 9th-magnitude secondary. They’re about 24” apart, easily split and far enough apart that their colors are obvious, even given their difference in magnitude.\n\nSunrise: 5:32 A.M.\n\nSunset: 8:26 P.M.\n\nMoonrise: 4:22 P.M.\n\nMoonset: 2:38 A.M.\n\nMoon Phase: Waxing gibbous (82%)",
    "summary": "",
    "authors": [
      "Alison Klesman"
    ],
    "source": "Sky this Week | Astronomy.com",
    "fetched_at": "2025-06-04T21:04:29.941843"
  },
  {
    "title": "The Sky This Week from May 23 to 30: Mars moves into Leo",
    "url": "https://www.astronomy.com/the-sky-this-week/the-sky-this-week-from-may-23-to-30-2025/",
    "published": "Fri, 23 May 2025 05:00:00 +0000",
    "content": "The Stars of Leo the Lion appear in this photograph with the Lion’s head angled down toward the horizon (lower right). Credit: John Flannery (Flickr, CC BY-ND 2.0)\n\nSky This Week is brought to you in part by Celestron.\n\nFriday, May 23\n\nThe Moon passes 4° north of Venus at 8 P.M. EDT, although neither is visible at that time.\n\nInstead, let’s look tonight for the small constellation Sagitta the Arrow, which lies north of Aquila the Eagle. Although Sagitta is small, covering just 80 square degrees (it is ranked 86th out of the 88 constellations in size) it hosts a few worthy deep-sky objects. The brightest is M71, a globular cluster that shines at magnitude 8.2 and spans roughly 7’.\n\nYou’ll find M71 1.4° west of magnitude 3.5 Gamma (γ) Sagittae. This globular is considered relatively “loose” — in fact, astronomers debated for some time whether it was an open or globular cluster. We now know it is the latter, residing some 13,000 light-years away and containing stars that are roughly 10 billion years old.\n\nM71 is a gorgeous sight through binoculars or any small scope, making it an ideal target for amateur observers looking to bag some easy sights. If you’re a more experienced observer with a larger aperture, look at M71 under high magnification to see if you can spot the dark notch on its western side, almost as if it’s missing a chunk of stars.\n\nSunrise: 5:38 A.M.\n\nSunset: 8:16 P.M.\n\nMoonrise: 3:12 A.M.\n\nMoonset: 4:23 P.M.\n\nMoon Phase: Waning crescent (17%)\n\n*Times for sunrise, sunset, moonrise, and moonset are given in local time from 40° N 90° W. The Moon’s illumination is given at 12 P.M. local time from the same location.\n\nSaturday, May 24\n\nLet’s check in with the Moon and Venus this morning, as the delicate waning crescent stands directly to the left of the bright planet before dawn. An hour before sunrise, the pair is some 10° high in the east, easily visible together in Pisces the Fish.\n\nThe Moon is now just 11 percent illuminated, well on its way to New in just two days. Through binoculars or a telescope, only a sliver of its western limb is illuminated, while the rest is in shadow. However, you might notice that even the shadowed regions of the lunar surface are visible, thanks to sunlight reflecting off Earth — a phenomenon called earthshine.\n\nTelescopic observers, move next to Venus, sitting to the Moon’s right. It’s the brightest point of light in the morning sky, shining at magnitude –4.5. The disk spans an impressive 26” and is now a 45-percent-lit crescent. Venus is approaching dichotomy, the time when it appears exactly half-lit by the Sun. It will reach this phase June 1, so watch its crescent grow ever-so-slightly over the next few days.\n\nSunrise: 5:38 A.M.\n\nSunset: 8:17 P.M.\n\nMoonrise: 3:39 A.M.\n\nMoonset: 5:42 P.M.\n\nMoon Phase: Waning crescent (9%)\n\nSunday, May 25\n\nMars has now crossed the border from Cancer into Leo, standing in the far western regions of the Lion’s domain. The Red Planet is visible after sunset this evening, slowly sinking in the west and setting around 1 A.M. local daylight time.\n\nThis offers plenty of time to inspect the ruddy world, which now glows at magnitude 1.2. It is fading slightly, losing about 0.1 magnitude every few weeks, and will continue to do so until October, when it slowly begins brightening again. Through a telescope, the martian disk is just 6” wide, offering little in the way of detail.\n\nJust to the upper left of Mars in the sky as it sets is an asterism called the Sickle of Leo. So named for its similarity in shape to the farm implement, the Sickle also looks like a backwards question mark. It is anchored at the base of its handle by Regulus, the Lion’s alpha star, which glows at magnitude 1.4 — just a tad fainter than Mars. From Regulus, move 4.8° due north to magnitude 3.5 Eta (η) Leonis, the next star in the Sickle, then 4.3° northeast to reach magnitude 2.0 Gamma Leo. Jump another 3.7° north of this star to reach magnitude 3.4 Zeta (ζ) Leo, then travel 6° northwest to magnitude 3.9 Mu (μ) Leo. Finally, take a short 2.7° hop southwest to Epsilon (ε) Leo, shining at magnitude 3.0, to end your journey at the tip of the Sickle’s blade.\n\nThe Moon reaches perigee — the closest point to Earth in its orbit — at 9:34 P.M. EDT this evening, when it will stand 223,086 miles (359,022 kilometers) away.\n\nSunrise: 5:37 A.M.\n\nSunset: 8:18 P.M.\n\nMoonrise: 4:09 A.M.\n\nMoonset: 7:03 P.M.\n\nMoon Phase: Waning crescent (3%)\n\nMonday, May 26\n\nWith New Moon occurring late tonight at 11:02 P.M. EDT, today is an excellent opportunity for yet more deep-sky observing. This morning, we’re dipping into the Lagoon Nebula (M8) in Sagittarius. This stunning nebula is best seen around 3 A.M. local daylight time, when it stands 25° high in the south.\n\nThe Lagoon lies within the diffuse, cloudy glow of the plane of the Milky Way. It sits to the upper right of the Teapot asterism in the Archer, about 5.6° west-northwest of magnitude 2.8 Lambda (λ) Sagittarii, the top of the Teapot’s triangular lid. Glowing at magnitude 4.6 and stretching some 90’ at its widest, the Lagoon is an emission nebula as well as a star-forming region that surrounds the young open star cluster NGC 6523. There’s also a notable dark lane of dust running through the nebula, visible with 10×50 binoculars. However, you’ll want to pull out a telescope to enjoy all the intricate detail the Lagoon has to offer. The brightest inner regions form a distinct hourglass shape, sometimes known separately as the Hourglass Nebula.\n\nThis lovely object is a favorite not only for observers but for astrophotographers as well, and you don’t need a lot of skill and experience to capture it. Even a medium-sized scope will net you gorgeous images with only about 20 minutes of exposure time.\n\nSunrise: 5:36 A.M.\n\nSunset: 8:18 P.M.\n\nMoonrise: 4:46 A.M.\n\nMoonset: 8:24 P.M.\n\nMoon Phase: New\n\nTuesday, May 27\n\nIf you’ve got binoculars or a small scope at your disposal, take them out tonight to observe the lovely — and bright — edge-on lenticular galaxy NGC 3115, sometimes called the Spindle Galaxy. Located in Sextans, you’ll find this galaxy still 25° high in the southwest 90 minutes after sunset, in a region to the lower left of Mars in the evening sky.\n\nTo locate the Spindle, first find the magnitude 5.1 star Gamma Sextantis. Move your gaze 3.2° east of this star and you’ll spot the Spindle, glowing at magnitude 8.9. It’s roughly four times as long as it is wide, stretching just over 8’ at its longest. Appearing much like its namesake, this galaxy has a bright, round bulge bordered by thinner protrusions on either side — these are not spiral arms, however, because NGC 3115 is not a spiral galaxy.\n\nLenticular galaxies are neither spirals nor ellipticals, but a sort of in-between object with a bulge and disk, but no arms. Astronomers aren’t sure whether they are an evolutionary step as spirals age, or if they might be the results of long-ago mergers.\n\nSunrise: 5:36 A.M.\n\nSunset: 8:19 P.M.\n\nMoonrise: 5:33 A.M.\n\nMoonset: 9:41 P.M.\n\nMoon Phase: Waxing crescent (1%)\n\nWednesday, May 28\n\nThe Moon passes 5° north of Jupiter at 9 A.M. EDT. Just six percent illuminated by this evening, you can try to spot the young crescent Moon hanging above the gas giant in the western sky after sunset.\n\nAn hour after the Sun disappears, Jupiter (shining at magnitude –1.9) is just 4° high in the west. Some 8.5° above it is the crescent Moon, near the border of Gemini and Auriga. You should be able to spot the brightest stars in these constellations quite well — Castor and Pollux mark the heads of Gemini to the Moon’s upper left, while Capella anchors the outline of Auriga to the Moon’s upper right. High above the Moon, the Big Dipper appears to stand on the end of its bowl in the early evening, its handle sticking straight up into the sky.\n\nJupiter’s Galilean moons are also visible this evening, but spotting them may be challenging with the planet so low. If you want to try, note that your location — which will affect the time you’re viewing the planet — will affect their positions.\n\nAbout an hour after sunset on the East Coast, Ganymede lies farthest from Jupiter to the east, with Europa closer to the planet. Callisto sits just off the gas giant’s northeastern limb, while Io may be hidden in the planet’s shadow — it will reappear just after 9:30 P.M. EDT just east of the planet, roughly in line with its equator and south of Callisto.\n\nAn hour after sunset in the Midwest, Io is now farther from the planet than Callisto (still near the northeastern limb), while Europa lies just to Io’s east, with Ganymede still farthest from the planet. An hour after sunset in the Mountain time zone, Callisto has moved into Jupiter’s shadow and is invisible, while Io has moved northeast of Europa and the latter is now closer to the planet. (They stand directly in line with each other with Io north of Europa around 9:10 P.M. MDT, potentially visible to those in the eastern half of this time zone.)\n\nFinally, by an hour after sunset on the West Coast, Callisto is again visible, forming the northern apex of a triangle with Europa to its southwest and Io to its southeast. Ganymede still lies far east of the other three moons, and all are still east of the planet.\n\nSunrise: 5:35 A.M.\n\nSunset: 8:20 P.M.\n\nMoonrise: 6:31 A.M.\n\nMoonset: 10:46 P.M.\n\nMoon Phase: Waxing crescent (4%)\n\nUpgren 1 in Canes Venatici is an excellent binocular object covering about 14′ on the sky. Credit: Alison Klesman (via TheSkyX)\n\nThursday, May 29\n\nBinocular observers, this one’s for you: Upgren 1, a small grouping of stars discovered in 1963 within the constellation Canes Venatici. High in the west around 10:30 P.M. local daylight time, the Hunting Dogs lie beneath the curve of the Big Dipper’s long handle.\n\nUpgren 1 contains about 10 stars in an area roughly 14’ wide. It sits 5° southwest of 3rd-magnitude Alpha (α) Canum Venaticorum, also called Cor Caroli, and appears like a tiny triangle in binoculars. The discoverer, Arthur Upgren, thought he was looking at an ancient cluster of stars. Today, however, we know this grouping is just a chance superposition on the sky, or an asterism, rather than an associated family of suns.\n\nMercury is in superior conjunction at midnight EDT and it is invisible for the time being. The small planet will reappear in the evening sky by the end of June’s first week.\n\nSunrise: 5:35 A.M.\n\nSunset: 8:21 P.M.\n\nMoonrise: 7:39 A.M.\n\nMoonset: 11:39 P.M.\n\nMoon Phase: Waxing crescent (9%)\n\nFriday, May 30\n\nLet’s close out the week with a peek at the early-morning duo of Saturn and Neptune, rising together in Pisces around 2:30 A.M. local daylight time. By 4 A.M. local daylight time they are some 15° high, with blazing Venus visible to their lower left. Saturn stands out well to the naked eye at magnitude 1.1, but Neptune (magnitude 7.8) will require binoculars or a telescope to see.\n\nThe two planets are now 1.7° apart and will fit well within the field of view of binoculars, a finder scope, or a wide-field telescope. Through a telescope, Saturn’s disk spans 17” and its rings stretch 38”. They are tilted some 3° to our line of sight, showing off their southern face. The planet’s largest moon, Titan, should be visible some 1.5’ east of the ringed planet this morning.\n\nNeptune’s disk is tiny, appearing just 2” across. The distant planet is northeast of Saturn and may appear like a “flat,” bluish-gray star.\n\nThe two planets will continue closing in on each other in the coming weeks, passing within 1° of each other late next month in a conjunction.\n\nSunrise: 5:34 A.M.\n\nSunset: 8:21 P.M.\n\nMoonrise: 8:52 A.M.\n\nMoonset: —\n\nMoon Phase: Waxing crescent (17%)",
    "summary": "",
    "authors": [
      "Alison Klesman"
    ],
    "source": "Sky this Week | Astronomy.com",
    "fetched_at": "2025-06-04T21:04:29.941844"
  },
  {
    "title": "Deep-Sky Dreams: Open cluster NGC 225",
    "url": "https://www.astronomy.com/observing/deep-sky-dreams-open-cluster-ngc-225/",
    "published": "Mon, 02 Jun 2025 20:43:15 +0000",
    "content": "NGC 225 in Cassiopeia is also known as the Sailboat Cluster or the Halloween Cat.\n\nThe open cluster NGC 225, sometimes called the Sailboat Cluster, and the surrounding region in Cassiopeia. Credit: Hunter Wilson\n\nIf you have the time and clear sky to the north, you might want to check out an open cluster that is seldom observed. An “average joe” open cluster in Cassiopeia nonetheless appears fairly bright and presents an almost circular pattern of stars.\n\nThis is NGC 225, sometimes called the Sailboat Cluster, or more recently the Halloween Cat for a group of stars within the cluster.\n\nNGC 225 is a relatively young cluster at roughly 150 million years, and lies about 2,200 light-years away.\n\nIts total magnitude is bright enough to make it visible in binoculars, at 7.0. The cluster spreads over 12’, about a third the diameter of the Full Moon.\n\nOther interesting features are intertwined with the same low-power field of view. A faint reflection nebula, van den Bergh 4, is associated with the cluster. Nearby lies a prominent dark nebula, LDN 1302.",
    "summary": "",
    "authors": [
      "David J. Eicher"
    ],
    "source": "News | Astronomy.com",
    "fetched_at": "2025-06-04T21:04:29.941846"
  },
  {
    "title": "JWST gazes into the distant past through gravitational lens",
    "url": "https://www.astronomy.com/science/jwst-gazes-into-the-distant-past-through-gravitational-lens/",
    "published": "Mon, 02 Jun 2025 20:25:29 +0000",
    "content": "Abell S1063 is the tight collection of galaxies in the center of this image. Around it are streaks of light, each representing a more distant galaxy whose image is being gravitationally lensed by Abell S1063. Credit: ESA/Webb/NASA/CSA/H. Atek and M. Zamani (ESA/Webb)\n\nThe James Webb Space Telescope (JWST) has captured a breathtaking new deep field image of the galaxy cluster Abell S1063, surpassing Hubble’s previous view in both depth and detail. Abell S1063, located 4.5 billion light-years away in the constellation Grus the Crane, acts as a gravitational lens. This massive cluster bends and focuses the light from galaxies lying far behind it, revealing some of the earliest galaxies in the universe.\n\nHubble’s 2016 deep field image of Abell S1063 first explored the cluster’s gravitational lensing effect, exposing warped arcs of light, distant galaxies that would otherwise remain hidden to astronomers. Now, JWST’s Near-Infrared Camera (NIRCam) brings these ancient galaxies into sharper focus, uncovering a larger number of distant galaxies from the early universe and other previously unseen features.\n\nThis remarkable image didn’t come easily. Unlike typical astronomical images, which already need long exposures, deep field images demand even more time, gathering as much light as possible to reveal the faintest objects in the universe. JWST’s image of Abell S1063 combined nine snapshots at different infrared wavelengths, totaling around 120 hours of observing time — JWST’s deepest gaze yet on a single target.\n\nStudying these primordial galaxies provides a window into how the first structures in the universe formed. By peering through the magnifying glass of Abell S1063, astronomers hope to piece together the story of how the earliest galaxies emerged, evolved, and ultimately gave rise to galaxies like our own Milky Way.\n\nWant to find out more? You can see more JWST deep-field images here and compare other images from Hubble and JWST here.\n\nRELATED: Learn more about gravitational lensing",
    "summary": "",
    "authors": [
      "Brooks Mendenhall"
    ],
    "source": "News | Astronomy.com",
    "fetched_at": "2025-06-04T21:04:29.941847"
  },
  {
    "title": "Europe stages a moon landing to learn how to photograph the real thing (photos)",
    "url": "https://www.space.com/astronomy/moon/europe-stages-a-moon-landing-to-learn-how-to-photograph-the-real-thing-photos",
    "published": "Wed, 04 Jun 2025 15:00:00 +0000",
    "content": "ESA astronauts Matthias Maurer and Aidan Cowley work in a simulated moon landscape, with stage lights recreating the lighting on the lunar surface. Another photographer dressed in protective gear stands to the left.\n\nPictures from a simulated moon landing, not designed to fool anyone into believing a fake but rather to provide a reference to make sure that we can get the best video images possible when astronauts finally do return to the moon, have been released by the European Space Agency (ESA).\n\nWhen Neil Armstrong clambered down the Eagle's lander to take his \"one giant leap\" in 1969, it was captured by a black-and-white slow-scan television (SSTV) with a resolution of a mere 320 lines and 10 frames per second. The transmission, beamed back via NASA's Deep Space Network , was sketchy, plagued by ghosts and poor contrast. The available 900 to 1,000 kiloHertz bandwidth just wasn't sufficient to transmit in color. Things improved slightly with Apollo 12 , which had a wider 2 to 3 megaHertz bandwidth that permitted color footage — at least until the video camera was accidentally pointed at the sun , the solar intensity damaging its vacuum tube.\n\nSoon, NASA's Artemis crewed moon missions will be flying with high-definition and ultra-high definition color cameras with frame rates of up to 60 per second. But even though the technology has dramatically improved since 1969, there remain many challenges for successfully documenting a lunar landing on video. Bandwidth continues to be one of these challenges, as does the 1.3-second signal delay from the moon, dealing with bright sunlight starkly reflecting off the lunar surface, and moon dust that seems to be able to find its way into every nook and cranny.\n\nEuropean astronaut Matthias Maurer takes a selfie during a simulated moonwalk exercise. (Image credit: ESA/M. Cowan)\n\nTherefore, taking detailed images and video footage of activities on the lunar surface and transmitting them back to Earth , all within the constraints of these challenges, is an acquired skill. We can't yet just pop to the moon to practice, so the next best thing is to simulate the environment of the moon somewhere on Earth.\n\nIndeed, this is the purpose of the LUNA facility in Cologne, Germany, which is a joint project between ESA and the German Aerospace Center (known by its German acronym DLR). The idea is to create a lunar environment that is as realistic as possible for testing robotic landers, training astronauts and practicing with equipment — including, in this case, cameras.\n\nTo that end, imaging experts from the Consultative Committee for Space Data Systems (CCSDS), which features representatives from 28 countries, have convened on LUNA to practice shooting astronauts playing make-believe in a simulated lunar environment.\n\nSpending time at LUNA gave imaging expert Melanie Cowan, who is ESA's representative on the CCSDS' Motion Imagery and Applications Working Group team, \"a glimpse of what it may be like on the moon,\" she said in a statement . \"One cannot get any closer to the real thing. It was a special and challenging experience to film and photograph in this surreal environment.\"\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nIndeed, so realistic was this pretend moon that Cowan and fellow imaging experts had to wear protective clothing to prevent the simulated lunar dust from being breathed in, or getting in their hair or on their clothes. Dust could be a major problem for astronauts spending any appreciable time on the surface; it is so fine that it gets everywhere, sticking to surfaces and potentially clogging up equipment.\n\nImaging expert Melanie Cowan dressed in protective gear for shooting in a simulated lunar landscape. (Image credit: ESA/DLR – M. Diegeler)\n\nSo, donned in their protective clothing reminiscent of the head-to-toe suits used in clean rooms, the imaging experts captured footage of astronauts descending from a mock lunar lander, exploring the surface and even taking a selfie — something that Neil Armstrong may have wished he'd had the opportunity to do. (There are famously few images of Armstrong on the moon, since he carried the Hasselblad camera during most of his and Buzz Aldrin 's historic moonwalk.) The point behind taking the selfie was to see how much detail could be captured in the reflection on the visor of the astronaut's helmet.\n\nThe resulting images and video are intended to be used as reference files for the real thing, so that astronauts and imaging technicians can better understand what camera settings to use, and how large the resulting image or video files might be when transmitted.\n\n\"These efforts should help agencies and companies create a ground truth for video applications and equipment,\" said Falk Schiffner, who is the DLR representative in the CCSDS Motion Imagery and Applications Working Group. \"The activities to refine video quality are not geared only to moon imagery, but to all space transmissions.\"\n\nCapturing good footage on the moon is not as easy as on Earth. For one thing, because there is no appreciable atmosphere on the moon to scatter sunlight, the contrast between areas directly illuminated by the sun and areas in black shadow can lead to over-exposed daylight areas and totally black shadowed regions. And the slow rise and setting of the sun over a two-week period from any given location results in slowly changing conditions. To replicate all of this at the LUNA facility required a lot of trial and error with camera angles and lighting.\n\n\"We tried different sun simulators and techniques to replicate the lighting of the sun on the moon,\" said Cowan. \"We investigated the effects of the shadows from the rocks and inside craters. Early tests revealed that HDR video will provide more detail in shadowed areas on the lunar surface.\"\n\nESA's Matthias Maurer takes a picture with a prototype lunar camera during the recent exercise. (Image credit: ESA/M. Cowan)\n\nHDR stands for \"high dynamic range,\" which can drastically improve the contrast ratio of an image, or boost its colors. Camera manufacturer Nikon has already teamed up with NASA to develop modified Nikon Z9 cameras to be used by astronauts should they land on the moon as part of the eventual Artemis 3 mission. The Nikon Z9 possesses both HDR and UHD (ultra-high definition) capabilities that will be essential for use in the strange, stark lunar landscape.\n\nTaking an 8K UHD video camera to the moon is one thing, but transmitting all that data back to Earth in a livestream (or as live as it can be with the 1.3-second delay) has limitations in the available bandwidth. In particular, footage containing lots of motion is referred to as an \"encoder killer,\" as it bumps the data rate way up. In practice, data transmission from the moon will be compressed, just as it already is from the International Space Station , for example, but even then methods will have to be found to squeeze it all into the available bandwidth without losing too much data.",
    "summary": "",
    "authors": [
      "Keith Cooper",
      "Contributing Writer",
      "Social Links Navigation"
    ],
    "source": "Latest from Space.com",
    "fetched_at": "2025-06-04T21:04:29.941848"
  },
  {
    "title": "Lunar landers and 'Transporter' tankers: Blue Origin unveils its blueprint for the moon",
    "url": "https://www.space.com/astronomy/moon/lunar-landers-and-transporter-tankers-blue-origin-unveils-its-blueprint-for-the-moon",
    "published": "Wed, 04 Jun 2025 14:00:00 +0000",
    "content": "Blue Origin's large, crew-carrying Mark 2 moon lander can deliver up to 22 tons (20 metric tons) to the lunar surface in a reusable configuration or up to 33 tons (30 metric tons) in a one-way configuration.\n\nBlue Origin has begun revealing how it plans to establish itself as a provider of hardware to enable long-term human stays on the moon.\n\nOne newly unveiled key element is the \"Transporter,\" a vehicle that can be launched on a single Blue Origin New Glenn rocket into low Earth orbit . It will harvest leftover propellant from the booster's second stage and then haul the hydrogen and oxygen to lunar orbit.\n\nTransporter is designed to lug roughly 110 tons (100 metric tons) from Earth orbit to lunar orbit. And in Mars mode, it will be able to haul 33 tons (30 metric tons) into orbit around the Red Planet.\n\nBlue Origin's lunar lander family — the Mark 1 and Mark 2 vehicles. (Image credit: Blue Origin)\n\nMaking its mark\n\nBlue Origin is also busily developing a robotic lander called Mark 1, as well as a Mark 2 version able to land up to four astronauts on the moon , either to equatorial or polar sites, depending on NASA requirements. A Mark 2 cargo-toting version has also been scoped out.\n\nMark 1 is capable of landing up to 3.3 tons (3 metric tons) on the moon. The larger Mark 2 vehicle can land up to 22 tons (20 metric tons) in a reusable configuration, or up to 33 tons (30 metric tons) in a one-way configuration, making it brawny enough to deliver habit modules to the lunar surface.\n\nThe Mark 2 lander is being developed under NASA's NextSTEP-2 Appendix P Sustaining Lunar Development (SLD) contract.\n\nBlue Origin's Transporter vehicle is designed to haul hydrogen and oxygen into lunar orbit. (Image credit: Blue Origin)\n\nHardware rich\n\nJohn Couluris, senior vice president of lunar permanence for Blue Origin, detailed the company's plans during a Lunar Surface Innovation Consortium (LSIC) meeting held from May 20 to May 22 at the Johns Hopkins University Applied Physics Laboratory in Maryland.\n\nGet the Space.com Newsletter Breaking space news, the latest updates on rocket launches, skywatching events and more! Contact me with news and offers from other Future brands Receive email from us on behalf of our trusted partners or sponsors\n\nIf we can open up the moon, Couluris said, it will become \"our eventual hub for the rest of the solar system .\"\n\nThe pace of Blue Origin work on lunar hardware is palpable.\n\nCouluris said Blue Origin is moving forward on becoming \"hardware rich,\" with the firm's target to get the production line moving — to support reliable access to the moon in a low-cost manner.\n\nSerial number one of the Mark 1 lunar lander, for example, is scheduled to fly to the moon's south pole for the first time this year.\n\nIf successful, Mark 1 would be the largest lander ever to touch down on the moon. Blue Origin is working with NASA's Commercial Lunar Payload Services (CLPS) initiative to outfit that first craft with the space agency's Stereo Cameras for Lunar Plume Surface Studies (SCALPSS) system, which will gauge the effects of the lander's engine plume on the dusty, rock-strewn lunar surface.\n\n\"We are currently building two of these vehicles,\" Couluris said, \"to get hardware rich.\"\n\nFirst moonshot\n\nCouluris underscored a key challenge that Blue Origin is working on — figuring out a way to make hydrogen and oxygen storable for appreciable lengths of time. These are the propellants for Blue Origin's BE engine line, which powers the Mark 1 and Mark 2 landers and the Transporter.\n\nSuccess in this area would therefore be huge, Couluris said.\n\n\"This opens up the solar system,\" making the moon a kind of JFK airport, according to Couluris.\n\nAnd Blue Origin is making serious progress on its lander propulsion system, he added.\n\n\"The build of this engine that's going to power our first Mark 1 is almost complete and will be integrated into the vehicle probably late summer,\" said Couluris.\n\nAt Blue Origin's facility in Washington state, the zero-boil-off technology is advancing, already demonstrated to work at temperatures of 20 Kelvin (minus 424 degrees Fahrenheit) and 90 Kelvin (minus 298 F) in the lab.\n\n\"We're making our first moonshot this year,\" said Jacqueline Cortese, senior director of civil space at Blue Origin. \"Prior to the end of this decade, we will be landing two crews on the lunar surface\" in partnership with NASA's Artemis program , she added.\n\nBlue Origin self-funded the Mark 1. No government resources went into the vehicle, Cortese told the LSIC audience. \"Ideally, we will have a successful first mission of Mark 1, then incorporate any findings and be ready to fly again,\" she said.\n\nThe Mark 1 will not only be the largest lander to ever touch down on the moon but also the only liquid oxygen/hydrogen-fueled lander to do so, Cortese said.\n\n\"So, please keep your fingers, toes — anything — crossed for a successful first Mark 1 mission this year,\" she said. \"It's been a long time coming for a lot of people at Blue Origin.\"\n\nBlue Origin's Mark 1 lunar lander is being readied for a potential moon launch by the end of 2025. (Image credit: Blue Origin)\n\nReinvent traditional aerospace\n\nThe moon is a stepping stone to Mars, Blue Origin CEO Dave Limp said at the 2025 Humans to the Moon and Mars Summit (H2M2), hosted by Explore Mars, Inc. and held May 28 to May 29 at George Washington University in Washington, D.C.\n\n\"If we're going to get to Mars , the path to that is getting back to the moon, and in a permanent way,\" Limp said.\n\nLimp also spotlighted Blue Origin's work on zero-boil-off technology and the firm's Transporter tanker. Lab demonstrations are \"coming along really well,\" with the firm's first prototype cryo-cooler coming online in the next couple of months.\n\n\"I'm very optimistic that this is going to be a solved problem in the next year or two,\" said Limp.\n\nBlue Origin is steadfast in its desire to dramatically lower the price of launching material from Earth , Limp said. And doing so means innovation by commercial companies, he added.\n\n\"We want to reinvent traditional aerospace,\" said Limp. \"We want to go faster. We want to be more decisive. We want to do it in a more cost-effective way. You can't use the traditional aerospace playbook and do all those things.\"\n\nDriving demand\n\nOf similar view is Brian Ippolitto, senior director of operations at Marotta Controls, an innovative aerospace and defense company.\n\n\"Commercial space leaders are actively positioning themselves at the forefront of cislunar and lunar development,\" Ippolitto told Space.com.\n\n\"As they continue to design and build platforms capable of operating beyond low Earth orbit, they are driving demand for more advanced and reliable components that can endure the extreme conditions of deep space,\" said Ippolitto.\n\nAmong the most significant challenges ahead, Ippolitto pointed out, \"are the requirements for colder operating temperatures and longer-duration missions — both critical to the success of sustained lunar presence.\"",
    "summary": "",
    "authors": [
      "Leonard David",
      "Space Insider Columnist",
      "Social Links Navigation"
    ],
    "source": "Latest from Space.com",
    "fetched_at": "2025-06-04T21:04:29.941850"
  }
]